#include <stdio.h>

int main() 
{
	printf("%s\n", "Message");
	return 0;
}

// Написать программу вывода сообщения на экран.
